[M_Sage_OldPukey MissionDefinition]
MissionDescription="Claptrap has picked up an ECHO blip from what he believes to be an old CL4P-TP unit. As he is more than a little eager for some robotic companionship, he wants you to track the signal and rescue the CL4P-TP."
TurnInDescription="Claptrap's hopes were once again dashed against the rocks of despair. Ha!"
MissionSummary="Find the lost CL4P-TP."
TeaserText="Hope you've got an empty stomach."

[M_Sage_OldPukey:FindPukey MissionObjectiveDefinition]
ProgressMessage="Find CL4P-TP unit"

[M_Sage_OldPukey:GetClaptrap MissionObjectiveDefinition]
ProgressMessage="Retrieve CL4P-TP unit"

[M_Sage_OldPukey:ProtectPukeySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Claptrap has picked up an ECHO blip from what he believes to be an old CL4P-TP unit. As he is more than a little eager for some robotic companionship, he wants you to track the signal and rescue the Claptrap.<br><br>As it turns out, the signal is emanating from a puking skag. Claptrap has asked you to protect the skag until he vomits up the CL4P-TP."
